TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиУсиленногоКонтроляКачества/гкс_НастройкиУсиленногоКонтроляКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиУсиленногоКонтроляКачества</name>
  <resources>
    <name>Базис</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателяМин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателяМакс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипВходногоКонтроля</name>
    <type>
      <types>EnumRef.гкс_ТипыУсиленногоКонтроляКачества</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтклонятьКачество</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЖДСтанция</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПравила</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ТранспортныеСредстваПоставщикаУсиленногоКонтроля/гкс_ТранспортныеСредстваПоставщикаУсиленногоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ТранспортныеСредстваПоставщикаУсиленногоКонтроля</name>
  <resources>
    <name>ЭтоПервоеТС</name>
    <comment>Признак первой в сутки машин</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыУсиленногоКонтроляКачества/гкс_ТипыУсиленногоКонтроляКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыУсиленногоКонтроляКачества</name>
  <enumValues>
    <name>КаждоеТС</name>
    <comment>Каждое транспортное средство</comment>
  </enumValues>
  <enumValues>
    <name>ПервоеТС</name>
    <comment>Первое транспортное средство</comment>
  </enumValues>
  <enumValues>
    <name>ГруппыТС</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыТранспортныхСредствДоставки/гкс_ТипыТранспортныхСредствДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыТранспортныхСредствДоставки</name>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Судно</name>
  </enumValues>
  <enumValues>
    <name>ЖДТранспорт</name>
  </enumValues>
  <enumValues>
    <name>Самолёт</name>
  </enumValues>
  <enumValues>
    <name>БезДоставки</name>
  </enumValues>
  <enumValues>
    <name>Трубопровод</name>
  </enumValues>
  <enumValues>
    <name>Контейнер</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_НазначенияИспользованияКачества/гкс_НазначенияИспользованияКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_НазначенияИспользованияКачества</name>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>ПриемкаКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ЭлеваторВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>ЛаборантВнешниеПробы</name>
  </enumValues>
  <enumValues>
    <name>КомпозитВнешниеПробыНаТысячуТон</name>
  </enumValues>
  <enumValues>
    <name>ПромежуточныйКомпозит</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйАнализ</name>
  </enumValues>
  <enumValues>
    <name>ПерепроверкаВнешнихПроб</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_РегистрацияНаПЛК/гкс_РегистрацияНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_РегистрацияНаПЛК</name>
  <basedOn>Document.гкс_ВъездНаКПП</basedOn>
  <registerRecords>AccumulationRegister.гкс_СДИЗНаПЛК</registerRecords>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПолучатель</name>
    <comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаПоставщика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Внутригрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаВъезда</name>
    <comment>Точка маршрута для определения проезда</comment>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ИДРейса</name>
    <comment>ERP-2176</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗоныКарантинногоКонтроляСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесоваяВъезда</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПроезда</name>
    <type>
      <types>CatalogRef.гкс_УсловияПроезда</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПогрузки</name>
    <type>
      <types>CatalogRef.гкс_СтруктураПЛК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаОтгрузкуПродукции</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгрузкаСОдногоБорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.гкс_ПрибытиеСуднаНаПЛК</types>
      <types>DocumentRef.гкс_ЗаписьВОчередьПриемкиПЛК</types>
      <types>DocumentRef.гкс_ВъездНаКПП</types>
      <types>DocumentRef.гкс_СРПВПрибытиеНаПуть</types>
    </type>
  </attributes>
  <attributes>
    <name>СДИЗ</name>
    <type>
      <types>CatalogRef.гкс_СДИЗЗЕРНО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаОснования</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиУсиленногоКонтроляКачества/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТочкаМаршрута)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Устанавливает тип входного контроля в настройках УК.
//
// Параметры:
//   ИдентификаторПравила - УникальныйИдентификатор - идентификатор правила
//   НовоеЗначение - ПеречислениеСсылка.гкс_ТипыУсиленногоКонтроляКачества - новое значение контроля
//
Процедура УстановитьТипВходногоКонтроля(ИдентификаторПравила, НовоеЗначение, ДатаОкончания) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.гкс_НастройкиУсиленногоКонтроляКачества.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторПравила.Установить(ИдентификаторПравила); 
	
	НаборЗаписей.Прочитать();
	
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		ЗаписьНабора.ТипВходногоКонтроля = НовоеЗначение;	
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда                          
			ЗаписьНабора.ДатаОкончания = ДатаОкончания;	
		КонецЕсли;
		
	КонецЦикла;
		
	НаборЗаписей.Записать();
	                                       		  	
КонецПроцедуры     

// Процедура копирует правило с заданным идентификатором
// Параметры:
// ИдентификаторПравила - УИД
// ДатаНачала - Дата
Процедура СоздатьКопиюПравилПоИдентификатору(ИдентификаторПравила, ДатаНачала) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	НастройкиУсиленногоКонтроляКачества.ВидПеревозки КАК ВидПеревозки,
	|	НастройкиУсиленногоКонтроляКачества.ТочкаМаршрута КАК ТочкаМаршрута,
	|	НастройкиУсиленногоКонтроляКачества.Номенклатура КАК Номенклатура,
	|	НастройкиУсиленногоКонтроляКачества.Показатель КАК Показатель,
	|	НастройкиУсиленногоКонтроляКачества.ТранспортноеСредство КАК ТранспортноеСредство,
	|	НастройкиУсиленногоКонтроляКачества.ПунктПогрузки КАК ПунктПогрузки,
	|	НастройкиУсиленногоКонтроляКачества.Поставщик КАК Поставщик,
	|	НастройкиУсиленногоКонтроляКачества.ЖДСтанция КАК ЖДСтанция,
	|	&ДатаНачала КАК ДатаНачала,
	|	НастройкиУсиленногоКонтроляКачества.ДатаОкончания КАК ДатаОкончания,
	|	НастройкиУсиленногоКонтроляКачества.Активен КАК Активен,
	|	НастройкиУсиленногоКонтроляКачества.Базис КАК Базис,
	|	НастройкиУсиленногоКонтроляКачества.ЗначениеПоказателяМин КАК ЗначениеПоказателяМин,
	|	НастройкиУсиленногоКонтроляКачества.ЗначениеПоказателяМакс КАК ЗначениеПоказателяМакс,
	|	НастройкиУсиленногоКонтроляКачества.ТипВходногоКонтроля КАК ТипВходногоКонтроля,
	|	НастройкиУсиленногоКонтроляКачества.КоличествоТС КАК КоличествоТС,
	|	НастройкиУсиленногоКонтроляКачества.ОтклонятьКачество КАК ОтклонятьКачество,
	|	&Комментарий КАК Комментарий
	|ИЗ
	|	РегистрСведений.гкс_НастройкиУсиленногоКонтроляКачества КАК НастройкиУсиленногоКонтроляКачества
	|ГДЕ
	|	НастройкиУсиленногоКонтроляКачества.ИдентификаторПравила = &ИдентификаторПравила
	|	И ВЫБОР
	|		КОГДА НастройкиУсиленногоКонтроляКачества.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	|		ИНАЧЕ НастройкиУсиленногоКонтроляКачества.ДатаОкончания
	|	КОНЕЦ >= &ДатаНачала
	|	И НастройкиУсиленногоКонтроляКачества.ТипВходногоКонтроля В (&ТипыКонтролей)
	|	И НастройкиУсиленногоКонтроляКачества.Активен";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала); 
	Запрос.УстановитьПараметр("ИдентификаторПравила", ИдентификаторПравила); 
	
	ТипыКонтролей = Новый СписокЗначений;
	ТипыКонтролей.Добавить(Перечисления.гкс_ТипыУсиленногоКонтроляКачества.ГруппыТС);
	ТипыКонтролей.Добавить(Перечисления.гкс_ТипыУсиленногоКонтроляКачества.ПервоеТС);
	Запрос.УстановитьПараметр("ТипыКонтролей", ТипыКонтролей); 
	
	Комментарий = НСтр("ru = 'Создан автоматически при перехоже правила на КаждоеТС'");
	Запрос.УстановитьПараметр("Комментарий", Комментарий); 
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	
	ТаблицаДанных = Результат.Выгрузить();
	ЗаписатьНастройкиПоказателейУсиленногоКонтроля(ТаблицаДанных);
		
КонецПроцедуры	

// Устанавливает признак активности в настройках УК.
//
// Параметры:
//   ИдентификаторПравила - УникальныйИдентификатор - идентификатор правила
//   НовоеЗначение - Булево - новое значение флага активности
//
Процедура УстановитьАктивность(ИдентификаторПравила, НовоеЗначение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.гкс_НастройкиУсиленногоКонтроляКачества.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторПравила.Установить(ИдентификаторПравила); 
	
	НаборЗаписей.Прочитать();
	
	Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
		ЗаписьНабора.Активен = НовоеЗначение;	
	КонецЦикла;
		
	НаборЗаписей.Записать();
	                                       		  	
КонецПроцедуры

// Возвращает перечень показателей качества для усиленного входного контроля
// Параметры:
// ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК
// МестнаяДата - Дата
// ВозвращаемоеЗначение 
// - ТаблицаЗначений - таблица показателей со значениями мин-макс
Функция НайтиПоказателиКачестваДляУсиленногоВходногоКонтроля(ДокументРегистрации, МестнаяДата) Экспорт
	
	ПустыеТМ = Новый СписокЗначений;
	ПустыеТМ.Добавить(Справочники.гкс_ТочкиМаршрута.ПустаяСсылка());
	ПустыеТМ.Добавить(Справочники.гкс_КлассификаторСтанцийЖД.ПустаяСсылка());                           
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	Запрос.УстановитьПараметр("МестнаяДата", МестнаяДата);
	Запрос.УстановитьПараметр("ПроизводственныеСутки", гкс_ПриемкаТранспорта.ПроизводственныеСуткиПоДата(МестнаяДата));
	Запрос.УстановитьПараметр("ЖДПеревозка", Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт);
	Запрос.УстановитьПараметр("ПустоеТС", Справочники.ТранспортныеСредства.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустыеТМ", ПустыеТМ);
	Запрос.УстановитьПараметр("КаждоеТС", Перечисления.гкс_ТипыУсиленногоКонтроляКачества.КаждоеТС);
	Запрос.УстановитьПараметр("НазначениеПриемка", Перечисления.гкс_НазначенияИспользованияКачества.Приемка);
	Запрос.УстановитьПараметр("НазначениеПромежуточныйКомпозит",
		Перечисления.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит);
	Запрос.УстановитьПараметр("ЕдиничнаяПроба", Перечисления.гкс_ТипыПроб.Единичная);	
	Запрос.УстановитьПараметр("КомпозитнаяПроба", Перечисления.гкс_ТипыПроб.Композитная);	
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаПодборПоказателейДляВходногоКонтроля(НомераТаблиц);
		
	Результаты = Запрос.ВыполнитьПакет(); 
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ПоказателиКонтроля", 	Результаты[НомераТаблиц.ПоказателиКонтроля].Выгрузить());
	СтруктураРезультата.Вставить("ПравилаКонтроля", 	Результаты[НомераТаблиц.ПравилаКонтроля].Выгрузить());
	СтруктураРезультата.Вставить("ПравилаКонтроляТС", 	Результаты[НомераТаблиц.ПравилаКонтроляТС].Выгрузить());
	
	Возврат 
		СтруктураРезультата;
	
КонецФункции

// Записывает настройки усиленного контроля
// Параметры:
// ТаблицаНастроек - ТаблицаЗначений
Процедура ЗаписатьНастройкиПоказателейУсиленногоКонтроля(ТаблицаНастроек) Экспорт  
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();                      
	Для каждого СтрокаДанных Из ТаблицаНастроек цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СтрокаДанных);
		Запись.ИдентификаторПравила = Новый УникальныйИдентификатор; 
	КонецЦикла;	                  
	НаборЗаписей.Записать(РежимЗамещения.Слияние);  
	
КонецПроцедуры	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

Функция ТекстЗапросаПодборПоказателейДляВходногоКонтроля(НомераТаблиц)
	
	НомераТаблиц.Вставить("ДанныеРегистрации", 			НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТаблицаВходногоКонтроля", 	НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВсеПравилаВходногоКонтроля", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПрименяемыеПравила", 		НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ТранспортныеСредстваПоставщика", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПравилаИтог", 				НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПоказателиКонтроля", 		НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПравилаКонтроля", 			НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ПравилаКонтроляТС", 			НомераТаблиц.Количество());
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегистрацияНаПЛК.ТочкаМаршрута КАК ТочкаМаршрута,
	|	РегистрацияНаПЛК.ВидПеревозки КАК ВидПеревозки,
	|	ВЫБОР
	|		КОГДА РегистрацияНаПЛК.ВидПеревозки = &ЖДПеревозка
	|			ТОГДА ЕСТЬNULL(ТочкиМаршрута.КодСтанцииЖД, ЗНАЧЕНИЕ(Справочник.гкс_КлассификаторСтанцийЖД.ПустаяССылка))
	|		ИНАЧЕ РегистрацияНаПЛК.ПунктПогрузки
	|	КОНЕЦ КАК ПунктПогрузки,
	|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура,
	|	РегистрацияНаПЛК.ТранспортноеСредство КАК ТранспортноеСредство,
	|	РегистрацияНаПЛК.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ДанныеРегистрации
	|ИЗ
	|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК ТочкиМаршрута
	|		ПО РегистрацияНаПЛК.ПунктПогрузки = ТочкиМаршрута.Ссылка
	|ГДЕ
	|	РегистрацияНаПЛК.Ссылка = &ДокументРегистрации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиУсиленногоКонтроляКачества.Показатель КАК Показатель,
	|	ВЫБОР
	|		КОГДА НастройкиУсиленногоКонтроляКачества.ВидПеревозки = &ЖДПеревозка
	|			ТОГДА НастройкиУсиленногоКонтроляКачества.ЖДСтанция
	|		ИНАЧЕ НастройкиУсиленногоКонтроляКачества.ПунктПогрузки
	|	КОНЕЦ КАК ПунктПогрузки,
	|	НастройкиУсиленногоКонтроляКачества.ТранспортноеСредство КАК ТранспортноеСредство,
	|	НастройкиУсиленногоКонтроляКачества.Поставщик КАК Поставщик,
	|	НастройкиУсиленногоКонтроляКачества.ЗначениеПоказателяМин КАК ЗначениеПоказателяМин,
	|	НастройкиУсиленногоКонтроляКачества.ЗначениеПоказателяМакс КАК ЗначениеПоказателяМакс,
	|	ВЫБОР
	|		КОГДА НастройкиУсиленногоКонтроляКачества.ТипВходногоКонтроля = &КаждоеТС
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроверятьКаждоеТС,
	|	НастройкиУсиленногоКонтроляКачества.Базис КАК Базис,
	|	НастройкиУсиленногоКонтроляКачества.ИдентификаторПравила КАК ИдентификаторПравила,
	|	НастройкиУсиленногоКонтроляКачества.ТипВходногоКонтроля КАК ТипВходногоКонтроля,
	|	НастройкиУсиленногоКонтроляКачества.КоличествоТС КАК КоличествоТС,
	|	НастройкиУсиленногоКонтроляКачества.ОтклонятьКачество КАК ОтклонятьКачество
	|ПОМЕСТИТЬ ТаблицаВходногоКонтроля
	|ИЗ
	|	РегистрСведений.гкс_НастройкиУсиленногоКонтроляКачества КАК НастройкиУсиленногоКонтроляКачества
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеРегистрации КАК ДанныеРегистрации
	|		ПО НастройкиУсиленногоКонтроляКачества.ВидПеревозки = ДанныеРегистрации.ВидПеревозки
	|			И НастройкиУсиленногоКонтроляКачества.ТочкаМаршрута = ДанныеРегистрации.ТочкаМаршрута
	|			И НастройкиУсиленногоКонтроляКачества.Номенклатура = ДанныеРегистрации.Номенклатура
	|ГДЕ
	|	НастройкиУсиленногоКонтроляКачества.Активен
	|	И НастройкиУсиленногоКонтроляКачества.ДатаНачала <= &ПроизводственныеСутки
	|	И &ПроизводственныеСутки <= ВЫБОР
	|			КОГДА НастройкиУсиленногоКонтроляКачества.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ДАТАВРЕМЯ(3999, 12, 31)
	|			ИНАЧЕ НастройкиУсиленногоКонтроляКачества.ДатаОкончания
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВходногоКонтроля.ИдентификаторПравила КАК ИдентификаторПравила
	|ПОМЕСТИТЬ ВсеПравилаВходногоКонтроля
	|ИЗ
	|	ДанныеРегистрации КАК ДанныеРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВходногоКонтроля КАК ТаблицаВходногоКонтроля
	|		ПО ДанныеРегистрации.Контрагент = ТаблицаВходногоКонтроля.Поставщик
	|			И ДанныеРегистрации.ТранспортноеСредство = ТаблицаВходногоКонтроля.ТранспортноеСредство
	|			И ДанныеРегистрации.ПунктПогрузки = ТаблицаВходногоКонтроля.ПунктПогрузки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаВходногоКонтроля.ИдентификаторПравила
	|ИЗ
	|	ДанныеРегистрации КАК ДанныеРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВходногоКонтроля КАК ТаблицаВходногоКонтроля
	|		ПО ДанныеРегистрации.Контрагент = ТаблицаВходногоКонтроля.Поставщик
	|			И ДанныеРегистрации.ПунктПогрузки = ТаблицаВходногоКонтроля.ПунктПогрузки
	|ГДЕ
	|	ТаблицаВходногоКонтроля.ТранспортноеСредство = &ПустоеТС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаВходногоКонтроля.ИдентификаторПравила
	|ИЗ
	|	ДанныеРегистрации КАК ДанныеРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВходногоКонтроля КАК ТаблицаВходногоКонтроля
	|		ПО ДанныеРегистрации.Контрагент = ТаблицаВходногоКонтроля.Поставщик
	|			И ДанныеРегистрации.ТранспортноеСредство = ТаблицаВходногоКонтроля.ТранспортноеСредство
	|ГДЕ
	|	ТаблицаВходногоКонтроля.ПунктПогрузки В(&ПустыеТМ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаВходногоКонтроля.ИдентификаторПравила
	|ИЗ
	|	ДанныеРегистрации КАК ДанныеРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВходногоКонтроля КАК ТаблицаВходногоКонтроля
	|		ПО ДанныеРегистрации.Контрагент = ТаблицаВходногоКонтроля.Поставщик
	|ГДЕ
	|	ТаблицаВходногоКонтроля.ПунктПогрузки В(&ПустыеТМ)
	|	И ТаблицаВходногоКонтроля.ТранспортноеСредство = &ПустоеТС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаВходногоКонтроля.ИдентификаторПравила
	|ИЗ
	|	ДанныеРегистрации КАК ДанныеРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВходногоКонтроля КАК ТаблицаВходногоКонтроля
	|		ПО ДанныеРегистрации.ТранспортноеСредство = ТаблицаВходногоКонтроля.ТранспортноеСредство
	|			И ДанныеРегистрации.ПунктПогрузки = ТаблицаВходногоКонтроля.ПунктПогрузки
	|ГДЕ
	|	ТаблицаВходногоКонтроля.Поставщик = &ПустойКонтрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаВходногоКонтроля.ИдентификаторПравила
	|ИЗ
	|	ДанныеРегистрации КАК ДанныеРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВходногоКонтроля КАК ТаблицаВходногоКонтроля
	|		ПО ДанныеРегистрации.ТранспортноеСредство = ТаблицаВходногоКонтроля.ТранспортноеСредство
	|ГДЕ
	|	ТаблицаВходногоКонтроля.Поставщик = &ПустойКонтрагент
	|	И ТаблицаВходногоКонтроля.ПунктПогрузки В(&ПустыеТМ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаВходногоКонтроля.ИдентификаторПравила
	|ИЗ
	|	ДанныеРегистрации КАК ДанныеРегистрации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВходногоКонтроля КАК ТаблицаВходногоКонтроля
	|		ПО ДанныеРегистрации.ПунктПогрузки = ТаблицаВходногоКонтроля.ПунктПогрузки
	|ГДЕ
	|	ТаблицаВходногоКонтроля.Поставщик = &ПустойКонтрагент
	|	И ТаблицаВходногоКонтроля.ТранспортноеСредство = &ПустоеТС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаВходногоКонтроля.ИдентификаторПравила
	|ИЗ
	|	ТаблицаВходногоКонтроля КАК ТаблицаВходногоКонтроля
	|ГДЕ
	|	ТаблицаВходногоКонтроля.Поставщик = &ПустойКонтрагент
	|	И ТаблицаВходногоКонтроля.ТранспортноеСредство = &ПустоеТС
	|	И ТаблицаВходногоКонтроля.ПунктПогрузки В(&ПустыеТМ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВходногоКонтроля.ТипВходногоКонтроля КАК ТипВходногоКонтроля,
	|	ТаблицаВходногоКонтроля.ИдентификаторПравила КАК ИдентификаторПравила,
	|	ТаблицаВходногоКонтроля.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ТаблицаВходногоКонтроля.Показатель КАК Показатель,
	|	ТаблицаВходногоКонтроля.ПунктПогрузки КАК ПунктПогрузки,
	|	ТаблицаВходногоКонтроля.Поставщик КАК Поставщик,
	|	ТаблицаВходногоКонтроля.ЗначениеПоказателяМин КАК ЗначениеПоказателяМин,
	|	ТаблицаВходногоКонтроля.ЗначениеПоказателяМакс КАК ЗначениеПоказателяМакс,
	|	ТаблицаВходногоКонтроля.Базис КАК Базис,
	|	ТаблицаВходногоКонтроля.КоличествоТС КАК КоличествоТС,
	|	ТаблицаВходногоКонтроля.ОтклонятьКачество КАК ОтклонятьКачество
	|ПОМЕСТИТЬ ПрименяемыеПравила
	|ИЗ
	|	ТаблицаВходногоКонтроля КАК ТаблицаВходногоКонтроля
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеПравилаВходногоКонтроля КАК ВсеПравилаВходногоКонтроля
	|		ПО ТаблицаВходногоКонтроля.ИдентификаторПравила = ВсеПравилаВходногоКонтроля.ИдентификаторПравила
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортныеСредстваПоставщикаУсиленногоКонтроля.Номенклатура КАК Номенклатура,
	|	ТранспортныеСредстваПоставщикаУсиленногоКонтроля.Контрагент КАК Контрагент,
	|	ТранспортныеСредстваПоставщикаУсиленногоКонтроля.ЭтоПервоеТС КАК ЭтоПервоеТС,
	|	ТранспортныеСредстваПоставщикаУсиленногоКонтроля.ДокументРегистрации КАК ДокументРегистрации
	|ПОМЕСТИТЬ ТранспортныеСредстваПоставщика
	|ИЗ
	|	РегистрСведений.гкс_ТранспортныеСредстваПоставщикаУсиленногоКонтроля КАК ТранспортныеСредстваПоставщикаУсиленногоКонтроля
	|ГДЕ
	|	ТранспортныеСредстваПоставщикаУсиленногоКонтроля.ПроизводственныеСутки = &ПроизводственныеСутки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрименяемыеПравила.ИдентификаторПравила КАК ИдентификаторПравила,
	|	ПрименяемыеПравила.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ПрименяемыеПравила.ТипВходногоКонтроля КАК ТипВходногоКонтроля,
	|	ПрименяемыеПравила.Показатель КАК Показатель,
	|	ПрименяемыеПравила.ЗначениеПоказателяМин КАК ЗначениеПоказателяМин,
	|	ПрименяемыеПравила.ЗначениеПоказателяМакс КАК ЗначениеПоказателяМакс,
	|	ПрименяемыеПравила.Базис КАК Базис,
	|	&НазначениеПриемка КАК НазначениеИспользования,
	|	0 КАК КоличествоТС,
	|	&ЕдиничнаяПроба КАК ТипПробы,
	|	ПрименяемыеПравила.ОтклонятьКачество КАК ОтклонятьКачество
	|ПОМЕСТИТЬ ПравилаИтог
	|ИЗ
	|	ПрименяемыеПравила КАК ПрименяемыеПравила
	|ГДЕ
	|	ПрименяемыеПравила.ТипВходногоКонтроля = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыУсиленногоКонтроляКачества.КаждоеТС)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрименяемыеПравила.ИдентификаторПравила,
	|	ПрименяемыеПравила.ТранспортноеСредство,
	|	ПрименяемыеПравила.ТипВходногоКонтроля,
	|	ПрименяемыеПравила.Показатель,
	|	ПрименяемыеПравила.ЗначениеПоказателяМин,
	|	ПрименяемыеПравила.ЗначениеПоказателяМакс,
	|	ПрименяемыеПравила.Базис,
	|	&НазначениеПриемка,
	|	0,
	|	&ЕдиничнаяПроба,
	|	ПрименяемыеПравила.ОтклонятьКачество
	|ИЗ
	|	ПрименяемыеПравила КАК ПрименяемыеПравила
	|ГДЕ
	|	НЕ ПрименяемыеПравила.ТранспортноеСредство = &ПустоеТС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрименяемыеПравила.ИдентификаторПравила,
	|	ПрименяемыеПравила.ТранспортноеСредство,
	|	ПрименяемыеПравила.ТипВходногоКонтроля,
	|	ПрименяемыеПравила.Показатель,
	|	ПрименяемыеПравила.ЗначениеПоказателяМин,
	|	ПрименяемыеПравила.ЗначениеПоказателяМакс,
	|	ПрименяемыеПравила.Базис,
	|	&НазначениеПриемка,
	|	0,
	|	&ЕдиничнаяПроба,
	|	ПрименяемыеПравила.ОтклонятьКачество
	|ИЗ
	|	ПрименяемыеПравила КАК ПрименяемыеПравила,
	|	ДанныеРегистрации КАК ДанныеРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТранспортныеСредстваПоставщика КАК ТранспортныеСредстваПоставщика
	|		ПО ДанныеРегистрации.Контрагент = ТранспортныеСредстваПоставщика.Контрагент
	|			И ДанныеРегистрации.Номенклатура = ТранспортныеСредстваПоставщика.Номенклатура
	|			И (ТранспортныеСредстваПоставщика.ЭтоПервоеТС)
	|ГДЕ
	|	ПрименяемыеПравила.ТипВходногоКонтроля = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыУсиленногоКонтроляКачества.ПервоеТС)
	|	И ТранспортныеСредстваПоставщика.ДокументРегистрации ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрименяемыеПравила.ИдентификаторПравила,
	|	ПрименяемыеПравила.ТранспортноеСредство,
	|	ПрименяемыеПравила.ТипВходногоКонтроля,
	|	ПрименяемыеПравила.Показатель,
	|	ПрименяемыеПравила.ЗначениеПоказателяМин,
	|	ПрименяемыеПравила.ЗначениеПоказателяМакс,
	|	ПрименяемыеПравила.Базис,
	|	&НазначениеПриемка,
	|	ПрименяемыеПравила.КоличествоТС,
	|	&ЕдиничнаяПроба,
	|	ПрименяемыеПравила.ОтклонятьКачество
	|ИЗ
	|	ПрименяемыеПравила КАК ПрименяемыеПравила,
	|	ДанныеРегистрации КАК ДанныеРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТранспортныеСредстваПоставщика КАК ТранспортныеСредстваПоставщика
	|		ПО ДанныеРегистрации.Контрагент = ТранспортныеСредстваПоставщика.Контрагент
	|			И ДанныеРегистрации.Номенклатура = ТранспортныеСредстваПоставщика.Номенклатура
	|			И (ТранспортныеСредстваПоставщика.ЭтоПервоеТС)
	|ГДЕ
	|	ПрименяемыеПравила.ТипВходногоКонтроля = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыУсиленногоКонтроляКачества.ГруппыТС)
	|	И ТранспортныеСредстваПоставщика.ДокументРегистрации ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрименяемыеПравила.ИдентификаторПравила,
	|	ПрименяемыеПравила.ТранспортноеСредство,
	|	ПрименяемыеПравила.ТипВходногоКонтроля,
	|	ПрименяемыеПравила.Показатель,
	|	ПрименяемыеПравила.ЗначениеПоказателяМин,
	|	ПрименяемыеПравила.ЗначениеПоказателяМакс,
	|	ПрименяемыеПравила.Базис,
	|	&НазначениеПромежуточныйКомпозит,
	|	ПрименяемыеПравила.КоличествоТС,
	|	&КомпозитнаяПроба,
	|	ПрименяемыеПравила.ОтклонятьКачество
	|ИЗ
	|	ПрименяемыеПравила КАК ПрименяемыеПравила,
	|	ДанныеРегистрации КАК ДанныеРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТранспортныеСредстваПоставщика КАК ТранспортныеСредстваПоставщика
	|		ПО ДанныеРегистрации.Контрагент = ТранспортныеСредстваПоставщика.Контрагент
	|			И ДанныеРегистрации.Номенклатура = ТранспортныеСредстваПоставщика.Номенклатура
	|			И (ТранспортныеСредстваПоставщика.ЭтоПервоеТС)
	|ГДЕ
	|	ПрименяемыеПравила.ТипВходногоКонтроля = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыУсиленногоКонтроляКачества.ГруппыТС)
	|	И НЕ ТранспортныеСредстваПоставщика.ДокументРегистрации ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ДокументРегистрации КАК ДокументРегистрации,
	|	ПравилаИтог.Показатель КАК Показатель,
	|	МАКСИМУМ(ПравилаИтог.ЗначениеПоказателяМин) КАК ЗначениеПоказателяМин,
	|	МИНИМУМ(ПравилаИтог.ЗначениеПоказателяМакс) КАК ЗначениеПоказателяМакс,
	|	МИНИМУМ(ПравилаИтог.Базис) КАК Базис,
	|	&ПроизводственныеСутки КАК ПроизводственныеСутки,
	|	&МестнаяДата КАК МестнаяДата,
	|	ПравилаИтог.НазначениеИспользования КАК НазначениеИспользования,
	|	ПравилаИтог.ТипПробы КАК ТипПробы,
	|	МАКСИМУМ(ПравилаИтог.ОтклонятьКачество) КАК ОтклонятьКачество
	|ИЗ
	|	ПравилаИтог КАК ПравилаИтог
	|
	|СГРУППИРОВАТЬ ПО
	|	ПравилаИтог.Показатель,
	|	ПравилаИтог.НазначениеИспользования,
	|	ПравилаИтог.ТипПробы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&ДокументРегистрации КАК ДокументРегистрации,
	|	ПравилаИтог.ИдентификаторПравила КАК ИдентификаторПравила,
	|	ПравилаИтог.Показатель КАК Показатель,
	|	ПравилаИтог.ТранспортноеСредство КАК ТранспортноеСредство,
	|	ПравилаИтог.ТипВходногоКонтроля КАК ТипВходногоКонтроля,
	|	&МестнаяДата КАК МестнаяДата,
	|	&ПроизводственныеСутки КАК ПроизводственныеСутки,
	|	ПравилаИтог.КоличествоТС КАК КоличествоТС
	|ИЗ
	|	ПравилаИтог КАК ПравилаИтог
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПравилаИтог.ИдентификаторПравила КАК ИдентификаторПравила
	|ИЗ
	|	ПравилаИтог КАК ПравилаИтог
	|ГДЕ
	|	НЕ ПравилаИтог.ТранспортноеСредство = &ПустоеТС";

КонецФункции	 

// Обработчик обновления регистра
Процедура ЗаполнитьПризнакОтклонятьКачество(Параметры = Неопределено) Экспорт
	
	СобытиеЖурнала = ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации();
		
	Запрос = Новый Запрос;
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	НастройкиУсиленногоКонтроляКачества.ИдентификаторПравила КАК ИдентификаторПравила
		|ИЗ
		|	РегистрСведений.гкс_НастройкиУсиленногоКонтроляКачества КАК НастройкиУсиленногоКонтроляКачества
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ПоказателиАнализовНоменклатуры КАК ПоказателиАнализовНоменклатуры
		|		ПО НастройкиУсиленногоКонтроляКачества.Показатель = ПоказателиАнализовНоменклатуры.Ссылка
		|ГДЕ
		|	ПоказателиАнализовНоменклатуры.гкс_ПриОтклоненииОтНормыОтклонятьКачество
		|	И ПоказателиАнализовНоменклатуры.гкс_ПриОтклоненииОтНормыОтклонятьКачество <> НастройкиУсиленногоКонтроляКачества.ОтклонятьКачество";  

	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоОбновленных = 0;
	НаборЗаписей = РегистрыСведений.гкс_НастройкиУсиленногоКонтроляКачества.СоздатьНаборЗаписей();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НачатьТранзакцию();
		Попытка      
			НаборЗаписей.Отбор.ИдентификаторПравила.Установить(Выборка.ИдентификаторПравила);
			НаборЗаписей.Прочитать();

            Для Каждого Запись Из НаборЗаписей Цикл
				Запись.ОтклонятьКачество = Истина;
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			КоличествоОбновленных = КоличествоОбновленных + 1;
			ЗафиксироватьТранзакцию();
    	Исключение
			ОтменитьТранзакцию();
			
			ИнфоОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать запись регистра Настройки усиленного контроля Качества
				|по причине: %1'"), ПодробноеПредставление);
			ЗаписьЖурналаРегистрации(СобытиеЖурнала, УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.гкс_НастройкиУсиленногоКонтроляКачества, , ТекстСообщения);
		КонецПопытки;
	КонецЦикла;
	
	ТекстСообщенияУспех = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обновлено записей в РС Настройки усиленного контроля Качества: %1.'"), КоличествоОбновленных);
	ЗаписьЖурналаРегистрации(
		СобытиеЖурнала, УровеньЖурналаРегистрации.Информация,
		Метаданные.РегистрыСведений.гкс_НастройкиУсиленногоКонтроляКачества, , ТекстСообщенияУспех);
		
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли
